GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_rtc.c
void stm32l0_rtc_set_calendar(unsigned int mask, const stm32l0_rtc_calendar_t *calendar)
{
    stm32l0_rtc_calendar_t before, after;
    int32_t d_seconds;
    uint16_t d_subseconds;

    NVIC_DisableIRQ(RTC_IRQn);

    /* Set all bits including RTC_ISR_INIT, hence no ISR flag gets cleaned.
     */
    RTC->ISR = ~0u | RTC_ISR_INIT;
    
    while (!(RTC->ISR & RTC_ISR_INITF))
    {
    }

    stm32l0_rtc_get_calendar(&before);

    after.subseconds = before.subseconds;
    after.seconds    = (mask & STM32L0_RTC_CALENDAR_MASK_SECONDS) ? calendar->seconds : before.seconds;
    after.minutes    = (mask & STM32L0_RTC_CALENDAR_MASK_MINUTES) ? calendar->minutes : before.minutes;
    after.hours      = (mask & STM32L0_RTC_CALENDAR_MASK_HOURS)   ? calendar->hours   : before.hours;
    after.day        = (mask & STM32L0_RTC_CALENDAR_MASK_DAY)     ? calendar->day     : before.day;
    after.month      = (mask & STM32L0_RTC_CALENDAR_MASK_MONTH)   ? calendar->month   : before.month;
    after.year       = (mask & STM32L0_RTC_CALENDAR_MASK_YEAR)    ? calendar->year    : before.year;

    RTC->TR = ((stm32l0_rtc_int_to_bcd[after.seconds] << RTC_TR_SU_Pos) |
               (stm32l0_rtc_int_to_bcd[after.minutes] << RTC_TR_MNU_Pos) |
               (stm32l0_rtc_int_to_bcd[after.hours] << RTC_TR_HU_Pos));

    RTC->DR = ((stm32l0_rtc_int_to_bcd[after.day] << RTC_DR_DU_Pos) |
               (stm32l0_rtc_int_to_bcd[after.month] << RTC_DR_MU_Pos) |
               (stm32l0_rtc_int_to_bcd[after.year] << RTC_DR_YU_Pos));

    stm32l0_rtc_calendar_subtract(&after, &before, &d_seconds, &d_subseconds);
    stm32l0_rtc_calendar_offset(&stm32l0_rtc_device.timer_reference, d_seconds, d_subseconds, &stm32l0_rtc_device.timer_reference);

    /* If there is a timer pending, adjust the start/stop calenadar to match
     * the new time base. If it already had fired, keep the pending state,
     * so that the timer_routine gets queued. 
     */
    if (stm32l0_rtc_device.timer_queue != NULL)
    {
        armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));

        stm32l0_rtc_calendar_offset(&stm32l0_rtc_device.timer_start, d_seconds, d_subseconds, &stm32l0_rtc_device.timer_start);
        stm32l0_rtc_calendar_offset(&stm32l0_rtc_device.timer_stop, d_seconds, d_subseconds, &stm32l0_rtc_device.timer_stop);

        while (!(RTC->ISR & RTC_ISR_ALRBWF))
        {
        }
        
        RTC->ALRMBR = ((stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.seconds] << RTC_ALRMAR_SU_Pos) |
                       (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.minutes] << RTC_ALRMAR_MNU_Pos) |
                       (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.hours] << RTC_ALRMAR_HU_Pos) |
                       (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.day] << RTC_ALRMAR_DU_Pos));
        
        RTC->ALRMBSSR = ((STM32L0_RTC_PREDIV_S - 1) - (stm32l0_rtc_device.timer_stop.subseconds / STM32L0_RTC_PREDIV_A)) | STM32L0_RTC_ALRMSSR_MASKSS;
    
        armv6m_atomic_or(&RTC->CR, (RTC_CR_ALRBIE | RTC_CR_ALRBE));
    }

    /* Set all bits excluding RTC_ISR_INIT, hence no ISR flag gets cleaned
     */
    RTC->ISR = ~0u & ~RTC_ISR_INIT;

    NVIC_EnableIRQ(RTC_IRQn);
}

int32_t stm32l0_rtc_get_calibration(void)
{
    if (RTC->CALR & RTC_CALR_CALP)
    {
        return 512 - ((int32_t)((RTC->CALR & RTC_CALR_CALM_Msk) >> RTC_CALR_CALM_Pos));
    }
    else
    {
        return - ((int32_t)((RTC->CALR & RTC_CALR_CALM_Msk) >> RTC_CALR_CALM_Pos));
    }
}

uint32_t stm32l0_rtc_get_subseconds(void)
{
    return ((STM32L0_RTC_PREDIV_S - 1) - (RTC->SSR & (STM32L0_RTC_PREDIV_S - 1))) * (32768 / STM32L0_RTC_PREDIV_S);
}

void stm32l0_rtc_adjust_subseconds(int32_t delta)
{
    if (delta > 0) 
    {
        if (delta > 32768) {
            delta = 32768;
        }

        RTC->SHIFTR = RTC_SHIFTR_ADD1S | (((uint32_t)(32768 - delta) / (32768 / STM32L0_RTC_PREDIV_S)) << RTC_SHIFTR_SUBFS_Pos);
    }
    else
    {
        if (delta < -32767) {
            delta = -32767;
        }

        RTC->SHIFTR = (((uint32_t)(-delta) / (32768 / STM32L0_RTC_PREDIV_S)) << RTC_SHIFTR_SUBFS_Pos);
    }

    while (RTC->ISR & RTC_ISR_SHPF)
    {
    }
}

void stm32l0_rtc_set_calibration(int32_t calibration)
{
    if (calibration > 0)
    {
        if (calibration > 512) {
            calibration = 512;
        }

        RTC->CALR = RTC_CALR_CALP | ((uint32_t)(512 - calibration) << RTC_CALR_CALM_Pos);
    }
    else
    {
        if (calibration < -511) {
            calibration = -511;
        }

        RTC->CALR = ((uint32_t)(-calibration) << RTC_CALR_CALM_Pos);
    }

    while (RTC->ISR & RTC_ISR_RECALPF)
    {
    }
}

void stm32l0_rtc_alarm_attach(unsigned int match, const stm32l0_rtc_alarm_t *alarm, stm32l0_rtc_callback_t callback, void *context)
{
    uint32_t n_alrmr;

    armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRAIE | RTC_CR_ALRAE));
    armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRAF | RTC_ISR_INIT));

    stm32l0_rtc_device.alarm_callback = callback;
    stm32l0_rtc_device.alarm_context = context;

    n_alrmr = 0;
    
    if (match & STM32L0_RTC_ALARM_MATCH_SECONDS) 
    {
        n_alrmr |= (stm32l0_rtc_int_to_bcd[alarm->seconds] << RTC_ALRMAR_SU_Pos);
    }
    else 
    {
        n_alrmr |= RTC_ALRMAR_MSK1;
    }
    
    if (match & STM32L0_RTC_ALARM_MATCH_MINUTES) 
    {
        n_alrmr |= (stm32l0_rtc_int_to_bcd[alarm->minutes] << RTC_ALRMAR_MNU_Pos);
    }
    else 
    {
        n_alrmr |= RTC_ALRMAR_MSK2;
    }
    
    if (match & STM32L0_RTC_ALARM_MATCH_HOURS) 
    {
        n_alrmr |= (stm32l0_rtc_int_to_bcd[alarm->hours] << RTC_ALRMAR_HU_Pos);
    }
    else 
    {
        n_alrmr |= RTC_ALRMAR_MSK3;
    }
    
    if (match & STM32L0_RTC_ALARM_MATCH_DAY) 
    {
        n_alrmr |= (stm32l0_rtc_int_to_bcd[alarm->day] << RTC_ALRMAR_DU_Pos);
    }
    else 
    {
        n_alrmr |= RTC_ALRMAR_MSK4;
    }
    
    while (!(RTC->ISR & RTC_ISR_ALRAWF))
    {
    }
    
    RTC->ALRMAR = n_alrmr;
    RTC->ALRMASSR = 0;
    
    armv6m_atomic_or(&RTC->CR, (RTC_CR_ALRAIE | RTC_CR_ALRAE));
}

void stm32l0_rtc_alarm_detach(void)
{
    stm32l0_rtc_device.alarm_callback = NULL;
    stm32l0_rtc_device.alarm_context = NULL;

