GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_rtc.c
    armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRAIE | RTC_CR_ALRAE));
    armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRAF | RTC_ISR_INIT));
}

static void stm32l0_rtc_timer_routine(void);

static void stm32l0_rtc_timer_alarm(uint32_t seconds, uint16_t subseconds)
{
    int32_t d_seconds;
    uint16_t d_subseconds;
    stm32l0_rtc_calendar_t calendar;

    if (seconds > STM32L0_RTC_TIMER_MAX_SECONDS)
    {
        seconds = STM32L0_RTC_TIMER_MAX_SECONDS;
        subseconds = 0;
    }

    stm32l0_rtc_device.timer_seconds = seconds;
    stm32l0_rtc_device.timer_subseconds = subseconds;
    stm32l0_rtc_calendar_offset(&stm32l0_rtc_device.timer_start, seconds, subseconds, &stm32l0_rtc_device.timer_stop);
    
    while (!(RTC->ISR & RTC_ISR_ALRBWF))
    {
    }
    
    RTC->ALRMBR = ((stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.seconds] << RTC_ALRMAR_SU_Pos) |
                   (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.minutes] << RTC_ALRMAR_MNU_Pos) |
                   (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.hours] << RTC_ALRMAR_HU_Pos) |
                   (stm32l0_rtc_int_to_bcd[stm32l0_rtc_device.timer_stop.day] << RTC_ALRMAR_DU_Pos));
    
    RTC->ALRMBSSR = ((STM32L0_RTC_PREDIV_S - 1) - (stm32l0_rtc_device.timer_stop.subseconds / STM32L0_RTC_PREDIV_A)) | STM32L0_RTC_ALRMSSR_MASKSS;
    
    armv6m_atomic_or(&RTC->CR, (RTC_CR_ALRBIE | RTC_CR_ALRBE));

    stm32l0_rtc_get_calendar(&calendar);
    stm32l0_rtc_calendar_subtract(&calendar, &stm32l0_rtc_device.timer_stop, &d_seconds, &d_subseconds);

    if (d_seconds >= 0)
    {
        /* Ok, here we started an alarm that was in the past (or same time).
         * Hence call the timeout handler and queue the next alarm.
         */

        if (!stm32l0_rtc_device.timer_event)
        {
            armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));
            armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRBF | RTC_ISR_INIT));
            
            armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_routine, NULL, 0);
        }
    }
    else
    {
        if ((d_seconds == -1) && (d_subseconds == (32768 - STM32L0_RTC_PREDIV_A)))
        {
            /* STM32L0 has an issue with RTC where if the alarm is exactly the next
             * tick, it will not raise an interrupt. Hence wait till the tick happened,
             * and if really no ISR fired, call the timeout handler and queue the next
             * alarm.
             */
            do
            {
                stm32l0_rtc_get_calendar(&calendar);
            }
            while (stm32l0_rtc_calendar_compare(&calendar, &stm32l0_rtc_device.timer_stop) < 0);

            if (!stm32l0_rtc_device.timer_event)
            {
                armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));
                armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRBF | RTC_ISR_INIT));

                armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_routine, NULL, 0);
            }
        }
    }
}

static void stm32l0_rtc_timer_routine(void)
{
    uint32_t seconds;
    uint16_t subseconds;
    stm32l0_rtc_timer_t *timer;
    stm32l0_rtc_timer_callback_t callback;

    seconds = stm32l0_rtc_device.timer_seconds;
    subseconds = stm32l0_rtc_device.timer_subseconds;

    stm32l0_rtc_device.timer_seconds = 0;
    stm32l0_rtc_device.timer_subseconds = 0;
    stm32l0_rtc_device.timer_start = stm32l0_rtc_device.timer_stop;

    while (stm32l0_rtc_device.timer_queue != NULL)
    {
        timer = stm32l0_rtc_device.timer_queue;

        if ((timer->seconds > seconds) || ((timer->seconds == seconds) && (timer->subseconds > subseconds)))
        {
            if (timer->subseconds < subseconds)
            {
                timer->seconds--;
                timer->subseconds += 32768;
            }

            timer->seconds -= seconds;
            timer->subseconds -= subseconds;
            break;
        }

        if (subseconds < timer->subseconds)
        {
            seconds--;
            subseconds += 32768;
        }

        seconds -= timer->seconds;
        subseconds -= timer->subseconds;

        if (timer->next == timer)
        {
            stm32l0_rtc_device.timer_queue = NULL;
        }
        else
        {
            stm32l0_rtc_device.timer_queue = timer->next;

            timer->next->previous = timer->previous;
            timer->previous->next = timer->next;
        }

        timer->next = NULL;
        timer->previous = NULL;
        timer->seconds = 0;
        timer->subseconds = 0;
        
        callback = timer->callback;
        
        if ((uint32_t)callback & 1)
        {
            (*callback)(timer->context, NULL);
        }
    }

    stm32l0_rtc_device.timer_event = 0;

    if (stm32l0_rtc_device.timer_queue != NULL)
    {
        stm32l0_rtc_timer_alarm(stm32l0_rtc_device.timer_queue->seconds, stm32l0_rtc_device.timer_queue->subseconds);
    }
}

static void stm32l0_rtc_timer_insert(stm32l0_rtc_timer_t *timer, uint32_t seconds, uint16_t subseconds, bool absolute)
{
    int32_t d_seconds;
    uint16_t d_subseconds;
    stm32l0_rtc_calendar_t calendar;
    stm32l0_rtc_timer_t *element;

    if (timer->next)
    {
        if (timer->next == timer)
        {
            stm32l0_rtc_device.timer_queue = NULL;
        }
        else
        {
            if (timer->next != stm32l0_rtc_device.timer_queue)
            {
                timer->next->seconds += timer->seconds;
                timer->next->subseconds += timer->subseconds;

                if (timer->next->subseconds >= 32768)
                {
                    timer->next->seconds += 1;
                    timer->next->subseconds -= 32768;
                }
            }
            
            if (timer == stm32l0_rtc_device.timer_queue)
            {
                stm32l0_rtc_device.timer_queue = timer->next;
            }

            timer->next->previous = timer->previous;
            timer->previous->next = timer->next;
        }
        
