GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_rtc.c
        timer->next = NULL;
        timer->previous = NULL;
        timer->seconds = 0;
        timer->subseconds = 0;
    }

    stm32l0_rtc_get_calendar(&calendar);

    if (absolute)
    {
        stm32l0_rtc_calendar_subtract(&calendar, &stm32l0_rtc_device.timer_reference, &d_seconds, &d_subseconds);

        if (stm32l0_rtc_time_compare(seconds, subseconds, d_seconds, d_subseconds) <= 0)
        {
            seconds = 0;
            subseconds = 0;
        }
        else
        {
            if (subseconds < d_subseconds)
            {
                seconds--;
                subseconds += 32768;
            }
            
            seconds -= d_seconds;
            subseconds -= d_subseconds;
        }
    }

    if (stm32l0_rtc_device.timer_queue == NULL)
    {
        timer->next = timer;
        timer->previous = timer;

        stm32l0_rtc_device.timer_queue = timer;
        stm32l0_rtc_device.timer_start = calendar;
    }
    else
    {
        stm32l0_rtc_calendar_subtract(&calendar, &stm32l0_rtc_device.timer_start, &d_seconds, &d_subseconds);

        seconds += d_seconds;
        subseconds += d_subseconds;

        if (subseconds >= 32768)
        {
            seconds += 1;
            subseconds -= 32768;
        }

        element = stm32l0_rtc_device.timer_queue;

        do
        {
            if ((element->seconds > seconds) || ((element->seconds == seconds) && (element->subseconds > subseconds)))
            {
                if (element->subseconds < subseconds)
                {
                    element->seconds--;
                    element->subseconds += 32768;
                }

                element->seconds -= seconds;
                element->subseconds -= subseconds;

                if (stm32l0_rtc_device.timer_queue == element)
                {
                    stm32l0_rtc_device.timer_queue = timer;
                }
                break;
            }
            
            if (subseconds < element->subseconds)
            {
                seconds--;
                subseconds += 32768;
            }
            
            seconds -= element->seconds;
            subseconds -= element->subseconds;

            element = element->next;
        }
        while (stm32l0_rtc_device.timer_queue != element);

        timer->previous = element->previous;
        timer->next = element;
    }

    timer->seconds = seconds;
    timer->subseconds = subseconds;
    timer->callback = (stm32l0_rtc_timer_callback_t)((uint32_t)timer->callback | 1);

    timer->next->previous = timer;
    timer->previous->next = timer;

    if (timer == stm32l0_rtc_device.timer_queue)
    {
        armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));
        armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRBF | RTC_ISR_INIT));

        if (!stm32l0_rtc_device.timer_event)
        {
            stm32l0_rtc_timer_alarm(seconds, subseconds);
        }
    }
}

static void stm32l0_rtc_timer_insert_1(stm32l0_rtc_timer_t *timer, uint32_t subseconds)
{
    timer->adjust = subseconds;
}

static void stm32l0_rtc_timer_insert_2(stm32l0_rtc_timer_t *timer, uint32_t seconds)
{
    stm32l0_rtc_timer_insert(timer, seconds, (timer->adjust & 0x7fff), !!(timer->adjust & 0x8000));
}

static void stm32l0_rtc_timer_remove(stm32l0_rtc_timer_t *timer)
{
    if (timer->next)
    {
        if (timer->next == timer)
        {
            stm32l0_rtc_device.timer_queue = NULL;
        }
        else
        {
            if (timer->next != stm32l0_rtc_device.timer_queue)
            {
                timer->next->seconds += timer->seconds;
                timer->next->subseconds += timer->subseconds;

                if (timer->next->subseconds >= 32768)
                {
                    timer->next->seconds += 1;
                    timer->next->subseconds -= 32768;
                }
            }
            
            if (timer == stm32l0_rtc_device.timer_queue)
            {
                stm32l0_rtc_device.timer_queue = timer->next;
            }

            timer->next->previous = timer->previous;
            timer->previous->next = timer->next;
        }
        
        timer->next = NULL;
        timer->previous = NULL;
        timer->seconds = 0;
        timer->subseconds = 0;
        
        armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));
        armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRBF | RTC_ISR_INIT));

        if (stm32l0_rtc_device.timer_queue != NULL)
        {
            if (!stm32l0_rtc_device.timer_event)
            {
                stm32l0_rtc_timer_alarm(stm32l0_rtc_device.timer_queue->seconds, stm32l0_rtc_device.timer_queue->subseconds);
            }
        }
    }
}

static void stm32l0_rtc_timer_release(stm32l0_rtc_timer_t *timer)
{
    stm32l0_rtc_timer_callback_t callback;

    stm32l0_rtc_timer_remove(timer);

    callback = (stm32l0_rtc_timer_callback_t)((uint32_t)timer->callback | 1);

    (*callback)(timer->context, timer);
}

void stm32l0_rtc_timer_reference(uint32_t *p_seconds, uint16_t *p_subseconds)
{
    stm32l0_rtc_calendar_t calendar;

    stm32l0_rtc_get_calendar(&calendar);
    stm32l0_rtc_calendar_subtract(&calendar, &stm32l0_rtc_device.timer_reference, (int32_t*)p_seconds, p_subseconds);
}

void stm32l0_rtc_timer_create(stm32l0_rtc_timer_t *timer, stm32l0_rtc_timer_callback_t callback, void *context)
{
    timer->next = NULL;
    timer->previous = NULL;
    timer->callback = callback;
    timer->context = context;
    timer->seconds = 0;
    timer->subseconds = 0;
}

bool stm32l0_rtc_timer_destroy(stm32l0_rtc_timer_t *timer)
{
    bool success = true;

    if (__get_IPSR() == 0)
    {
        armv6m_svcall_1((uint32_t)&stm32l0_rtc_timer_release, (uint32_t)timer);
    }
    else
    {
        success = armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_release, (void*)timer, 0);
    }

    return success;
}

bool stm32l0_rtc_timer_start(stm32l0_rtc_timer_t *timer, uint32_t seconds, uint16_t subseconds, bool absolute)
{
    bool success = true;

    if (__get_IPSR() == 0)
    {
        armv6m_svcall_4((uint32_t)&stm32l0_rtc_timer_insert, (uint32_t)timer, seconds, subseconds, absolute);
    }
    else
    {
        success = armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_insert_1, (void*)timer, subseconds | (absolute ? 0x8000 : 0x0000));

        if (success)
        {
            success = armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_insert_2, (void*)timer, seconds);
        }
    }

    return success;
}

bool stm32l0_rtc_timer_stop(stm32l0_rtc_timer_t *timer)
{
    bool success = true;

    if (__get_IPSR() == 0)
    {
        armv6m_svcall_2((uint32_t)&stm32l0_rtc_timer_remove, (uint32_t)timer, 0);
    }
    else
    {
        success = armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_remove, (void*)timer, 0);

        if (success)
        {
            armv6m_atomic_and((volatile uint32_t *)&timer->callback, ~1);
        }
    }

    return success;
}

void stm32l0_rtc_wakeup_start(uint32_t timeout, stm32l0_rtc_callback_t callback, void *context)
{
    uint32_t ticks, seconds, rtc_wutr, rtc_cr;

    stm32l0_rtc_device.wakeup_callback = callback;
    stm32l0_rtc_device.wakeup_context = context;

    if (timeout <= 32000)
    {
        ticks = (timeout * 2048) / 1000;
 
        rtc_wutr = ticks - 1;
        rtc_cr = 0;
    }
    else
    {
        seconds = timeout / 1000;
        
        if (seconds <= 65536)
        {
            rtc_wutr = seconds - 1;
            rtc_cr = (RTC_CR_WUCKSEL_2);
        }
        else
        {
            if (seconds > 131072)
            {
                seconds = 131072;
            }

