GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_rtc.c
            rtc_wutr = (seconds - 65536) - 1;
            rtc_cr = (RTC_CR_WUCKSEL_2 | RTC_CR_WUCKSEL_1);
        }
    }
    
    while (!(RTC->ISR & RTC_ISR_WUTWF))
    {
    }

    RTC->WUTR = rtc_wutr;

    armv6m_atomic_or(&RTC->CR, (RTC_CR_WUTIE | RTC_CR_WUTE | rtc_cr));
}

void stm32l0_rtc_wakeup_stop(void)
{
    armv6m_atomic_and(&RTC->CR, ~(RTC_CR_WUTIE | RTC_CR_WUTE | RTC_CR_WUCKSEL));
    armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_WUTF | RTC_ISR_INIT));

    EXTI->PR = EXTI_PR_PIF20;
}

bool stm32l0_rtc_wakeup_done(void)
{
  return !(RTC->CR & RTC_CR_WUTE);
}

void stm32l0_rtc_standby(void)
{
    /* Called with IRQs disabled */

    RTC->CR &= ~(RTC_CR_TSIE | RTC_CR_WUTIE | RTC_CR_ALRBIE | RTC_CR_TSE | RTC_CR_WUTE | RTC_CR_ALRBE);
    RTC->ISR = 0;

    EXTI->PR = EXTI_PR_PIF20 | EXTI_PR_PIF19 | EXTI_PR_PIF17;
}

void stm32l0_rtc_reset(void)
{
    /* Called with IRQs disabled */

    RTC->CR &= ~(RTC_CR_TSIE | RTC_CR_WUTIE | RTC_CR_ALRBIE | RTC_CR_ALRAIE | RTC_CR_TSE | RTC_CR_WUTE | RTC_CR_ALRBE | RTC_CR_ALRAE);
    RTC->ISR = 0;

    EXTI->PR = EXTI_PR_PIF20 | EXTI_PR_PIF19 | EXTI_PR_PIF17;

    /* Lock RTC throu reset */
    RTC->WPR = 0x00;
}

static const uint16_t stm32l0_rtc_days_since_month[2][12] = {
    {   0,  31,  59,  90, 120, 151, 181, 212, 243, 273, 304, 334, },
    {   0,  31,  60,  91, 121, 152, 182, 213, 244, 274, 305, 335, },
};

void stm32l0_rtc_calendar_to_time(const stm32l0_rtc_calendar_t *calendar, uint32_t *p_seconds, uint16_t *p_subseconds)
{
    *p_seconds = ((((((((calendar->year * 365 + ((calendar->year +3) / 4)) +
                        stm32l0_rtc_days_since_month[(calendar->year & 3) == 0][calendar->month -1] +
                        (calendar->day -1)) * 24) +
                      calendar->hours) * 60) +
                    calendar->minutes) * 60) +
                  calendar->seconds);
    
    *p_subseconds = calendar->subseconds;
}

void stm32l0_rtc_time_to_calendar(uint32_t seconds, uint16_t subseconds, stm32l0_rtc_calendar_t *p_calendar)
{
    uint32_t minutes, hours, days, months, years;

    p_calendar->subseconds = subseconds;
    p_calendar->seconds = seconds % 60; minutes = seconds / 60;
    p_calendar->minutes = minutes % 60; hours = minutes / 60;
    p_calendar->hours = hours % 24; days = hours / 24;

    years = (days / 365);
    
    if ((years * 365 + ((years +3) / 4)) > days)
    {
        years--;
    }

    days -= (years * 365 + ((years +3) / 4));

    months = (days / 29);

    if ((months >= 12) || (stm32l0_rtc_days_since_month[(years & 3) == 0][months] > days))
    {
        months--;
    }

    days -= stm32l0_rtc_days_since_month[(years & 3) == 0][months];
    
    p_calendar->day = days +1;
    p_calendar->month = months +1;
    p_calendar->year = years;
}

int stm32l0_rtc_calendar_compare(const stm32l0_rtc_calendar_t *a_calendar, const stm32l0_rtc_calendar_t *b_calendar)
{
    int delta;

    /* This code depends upon the ordering withing the stm32l0_rtc_calendar_t struct.
     */
    delta = ((const uint32_t*)a_calendar)[1] - ((const uint32_t*)b_calendar)[1];
    
    if (!delta)
    {
        delta = ((const uint32_t*)a_calendar)[0] - ((const uint32_t*)b_calendar)[0];
    }

    if (delta < 0) delta = -1;
    if (delta > 0) delta =  1;

    return delta;
}

void stm32l0_rtc_calendar_subtract(const stm32l0_rtc_calendar_t *a_calendar, const stm32l0_rtc_calendar_t *b_calendar, int32_t *p_seconds, uint16_t *p_subseconds)
{
    int32_t seconds;
    uint16_t subseconds;

    seconds = (((((((((a_calendar->year * 365 + ((a_calendar->year +3) / 4)) +
                      stm32l0_rtc_days_since_month[(a_calendar->year & 3) == 0][a_calendar->month -1] +
                      (a_calendar->day -1)) -
                     ((b_calendar->year * 365 + ((b_calendar->year +3) / 4)) +
                      stm32l0_rtc_days_since_month[(b_calendar->year & 3) == 0][b_calendar->month -1] +
                      (b_calendar->day -1))) * 24) +
                   a_calendar->hours -
                   b_calendar->hours) * 60) +
                 a_calendar->minutes -
                 b_calendar->minutes) * 60) +
               a_calendar->seconds -
               b_calendar->seconds);

    if (a_calendar->subseconds < b_calendar->subseconds)
    {
        subseconds = (32768 + a_calendar->subseconds) - b_calendar->subseconds;

        seconds--;
    }
    else
    {
        subseconds = a_calendar->subseconds - b_calendar->subseconds;
    }

    *p_seconds = seconds;
    *p_subseconds = subseconds;
}

void stm32l0_rtc_calendar_offset(const stm32l0_rtc_calendar_t *a_calendar, int32_t b_seconds, uint16_t b_subseconds, stm32l0_rtc_calendar_t *p_calendar)
{
    uint32_t offset, minutes, hours, days, months, years, seconds;
    uint16_t subseconds;

    if (b_seconds >= 0)
    {
        p_calendar->subseconds = a_calendar->subseconds + b_subseconds;
        p_calendar->seconds = a_calendar->seconds;
        p_calendar->minutes = a_calendar->minutes;
        p_calendar->hours = a_calendar->hours;
        p_calendar->day = a_calendar->day;
        p_calendar->month = a_calendar->month;
        p_calendar->year = a_calendar->year;
        
        if (p_calendar->subseconds >= 32768) 
        {
            p_calendar->subseconds -= 32768;
            
            b_seconds++;
        }
        
        if (b_seconds)
        {
            offset = a_calendar->seconds + b_seconds;
            
            if (offset < 60)
            {
                p_calendar->seconds = offset;
            }
            else
            {
                offset += (a_calendar->minutes * 60);
                
                if (offset < 3600)
                {
                    p_calendar->seconds = offset % 60; minutes = offset / 60;
                    p_calendar->minutes = minutes % 60;
                }
                else
                {
                    offset += (a_calendar->hours * 3600);
                    
                    p_calendar->seconds = offset % 60; minutes = offset / 60;
                    p_calendar->minutes = minutes % 60; hours = minutes / 60;
                    p_calendar->hours = hours % 24; days = hours / 24;
                    
                    if (days)
                    {
                        days += ((a_calendar->year * 365 + ((a_calendar->year +3) / 4)) +
                                 stm32l0_rtc_days_since_month[(a_calendar->year & 3) == 0][a_calendar->month -1] +
                                 (a_calendar->day -1));
                    
                        years = (days / 365);
                    
                        if ((years * 365 + ((years +3) / 4)) > days)
                        {
                            years--;
                        }
                    
