GrumpyOldPizza/ArduinoCore-stm32l0/system/STM32L0xx/Source/stm32l0_rtc.c
                        days -= (years * 365 + ((years +3) / 4));
                    
                        months = (days / 29);
                    
                        if ((months >= 12) || (stm32l0_rtc_days_since_month[(years & 3) == 0][months] > days))
                        {
                            months--;
                        }
                    
                        days -= stm32l0_rtc_days_since_month[(years & 3) == 0][months];
                    
                        p_calendar->day = days +1;
                        p_calendar->month = months +1;
                        p_calendar->year = years;
                    }
                }
            }
        }
    }
    else
    {
        stm32l0_rtc_calendar_to_time(a_calendar, &seconds, &subseconds);
        stm32l0_rtc_time_offset(seconds, subseconds, b_seconds, b_subseconds, &seconds, &subseconds);
        stm32l0_rtc_time_to_calendar(seconds, subseconds, p_calendar);
    }
}

int stm32l0_rtc_time_compare(uint32_t a_seconds, uint16_t a_subseconds, uint32_t b_seconds, uint16_t b_subseconds)
{
    int delta;

    delta = a_seconds - b_seconds;
    
    if (!delta)
    {
        delta = a_subseconds - b_subseconds;
    }

    if (delta < 0) delta = -1;
    if (delta > 0) delta =  1;

    return delta;
}

void stm32l0_rtc_time_subtract(uint32_t a_seconds, uint16_t a_subseconds, uint32_t b_seconds, uint16_t b_subseconds, int32_t *p_seconds, uint16_t *p_subseconds)
{
    int32_t seconds;
    uint16_t subseconds;

    if (a_subseconds < b_subseconds)
    {
        a_subseconds += 32768;
        a_seconds--;
    }

    seconds = a_seconds - b_seconds;
    subseconds = a_subseconds - b_subseconds;

    *p_seconds = seconds;
    *p_subseconds = subseconds;
}

void stm32l0_rtc_time_offset(uint32_t a_seconds, uint16_t a_subseconds, int32_t b_seconds, uint16_t b_subseconds, uint32_t *p_seconds, uint16_t *p_subseconds)
{
    uint32_t seconds;
    uint16_t subseconds;

    seconds = a_seconds + b_seconds;
    subseconds = a_subseconds + b_subseconds;

    if (subseconds >= 32678)
    {
        subseconds -= 32768;
        seconds++;
    }

    *p_seconds = seconds;
    *p_subseconds = subseconds;
}

void RTC_IRQHandler(void)
{
    if (EXTI->PR & EXTI_PR_PIF17)
    {
        EXTI->PR = EXTI_PR_PIF17;

        if (RTC->ISR & RTC_ISR_ALRAF)
        {
            armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRAF | RTC_ISR_INIT));
            
            if (stm32l0_rtc_device.alarm_callback)
            {
                (*stm32l0_rtc_device.alarm_callback)(stm32l0_rtc_device.alarm_context);
            }
        }

        if (RTC->ISR & RTC_ISR_ALRBF)
        {
            armv6m_atomic_and(&RTC->CR, ~(RTC_CR_ALRBIE | RTC_CR_ALRBE));
            armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_ALRBF | RTC_ISR_INIT));
            
            if (stm32l0_rtc_device.timer_queue != NULL)
            {
                stm32l0_rtc_device.timer_event = 1;
                
                armv6m_pendsv_enqueue((armv6m_pendsv_routine_t)stm32l0_rtc_timer_routine, NULL, 0);
            }
        }
    }

    if (EXTI->PR & EXTI_PR_PIF19)
    {
        EXTI->PR = EXTI_PR_PIF19;
    }

    if (EXTI->PR & EXTI_PR_PIF20)
    {
        EXTI->PR = EXTI_PR_PIF20;

        if (RTC->ISR & RTC_ISR_WUTF)
        {
            armv6m_atomic_and(&RTC->CR, ~(RTC_CR_WUTIE | RTC_CR_WUTE | RTC_CR_WUCKSEL));
            armv6m_atomic_modify(&RTC->ISR, ~RTC_ISR_INIT, ~(RTC_ISR_WUTF | RTC_ISR_INIT));

            if (stm32l0_rtc_device.wakeup_callback)
            {
                (*stm32l0_rtc_device.wakeup_callback)(stm32l0_rtc_device.wakeup_context);
            }
        }
    }
}
